Tekla Open API Reference for Tekla Structures 2025
RebarSet.Guidelines Property
 Gets or sets the rebar set's guidelines.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<RebarGuideline> Guidelines { get; set; }
Public Property Guidelines As List(Of RebarGuideline)
	Get
	Set
Property Value
Type: List<RebarGuideline>
See Also
Reference
RebarSet Class
Tekla.Structures.Model Namespace